{
  "required": [
    "description",
    "hasVersion",
    "fullName",
    "shortName"
  ],
  "properties": {
    "custodian": {
      "type": "array",      
      "minItems": 1,
      "uniqueItems": true,
      "_instruction": "Add one or several person(s) or organization(s) that fulfills the role of a custodian. The role of the custodian is typically fulfilled by a research group leader or principal investigator, but could also be carried out by an organization. Custodians are typically the main contact in case of misconduct, obtain permission from the contributors to publish personal information, and maintain the content and quality of the data, metadata, and/or code of a research product. Unless specified differently, this custodian will be responsible for all attached research product versions.",
      "_linkedCategories": [
        "legalPerson"
      ]
    },
    "description": {
      "type": "string",
      "maxLength": 2000,
      "_instruction": "Enter a description (abstract) for this research product (max. 2000 characters, incl. spaces; no references). Note that this description should be fitting for all attached research product versions."
    },
    "fullName": {
      "type": "string",
      "_instruction": "Enter a descriptive full name (title) for this research product.  Note that this full name should be fitting for all attached research product versions."
    },
    "homepage": {
      "_instruction": "Add the uniform resource locator (URL) to the homepage of this research product.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/core/URL"
      ]
    },
    "howToCite": {
      "type": "string",
      "_instruction": "Enter the preferred citation text for this research product. Leave blank if citation text can be extracted from the assigned digital identifier."
    },
    "shortName": {
      "type": "string",
      "maxLength": 30,
      "_instruction": "Enter a short name (alias) for this research product (max. 30 characters; no space)."
    }
  }
}
