{  
  "_categories": [
    "researchProduct"
  ],
  "required": [
    "accessibility",
    "fullDocumentation",
    "releaseDate",
    "shortName",
    "versionIdentifier",
    "versionInnovation"
  ],
  "properties": {
    "accessibility": {
      "_instruction": "Add the accessibility of the data for this research product version.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/controlledTerms/ProductAccessibility"
      ]
    },
    "copyright": {
      "_instruction": "Enter the copyright information of this research product version.",
      "_embeddedTypes": [
        "https://openminds.ebrains.eu/core/Copyright"
      ]
    },
    "custodian": {
      "type": "array",      
      "minItems": 1,
      "uniqueItems": true,
      "_instruction": "Add all parties that fulfill the role of a custodian for the research product version (e.g., a research group leader or principle investigator). Custodians are typically the main contact in case of misconduct, obtain permission from the contributors to publish personal information, and maintain the content and quality of the data, metadata, and/or code of the research product version.",
      "_linkedCategories": [
        "legalPerson"
      ]
    },
    "description": {
      "type": "string",
      "_instruction": "Enter a description (or abstract) of this research product version. Note that this version specific description will overwrite the description for the overarching dataset."
    },
    "fullDocumentation": {
      "_instruction": "Add the publication or file that acts as the full documentation of this research product version.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/core/DOI",
        "https://openminds.ebrains.eu/core/File",
        "https://openminds.ebrains.eu/core/WebResource"
      ]
    },
    "fullName": {
      "type": "string",
      "_instruction": "Enter a descriptive full name (or title) for this research product version. Note that this version specific full name will overwrite the full name for the overarching dataset."
    },
    "funding": {
      "type": "array",
      "minItems": 1,
      "uniqueItems": true,
      "_instruction": "Add all funding information of this research product version.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/core/Funding"
      ]
    },
    "homepage": {      
      "type": "string",
      "_formats": [
        "iri"
      ],
      "_instruction": "Enter the internationalized resource identifier (IRI) to the homepage of this research product version."
    },
    "howToCite": {
      "type": "string",
      "_instruction": "Enter the preferred citation text for this research product version. Leave blank if citation text can be extracted from the assigned digital identifier."
    },
    "keyword": {
      "type": "array",      
      "minItems": 1, 
      "uniqueItems": true,
      "_instruction": "Add all relevant keywords to this research product version either by adding controlled terms or by suggesting new terms.",
      "_linkedCategories": [
        "keyword"
      ]
    },
    "otherContribution": {
      "type": "array",
      "minItems": 1,
      "uniqueItems": true,
      "_instruction": "Add any other contributions to this research product version that are not covered under 'author'/'developer' or 'custodian'.",
      "_embeddedTypes": [
        "https://openminds.ebrains.eu/core/Contribution"
      ]
    },
    "relatedPublication": {
      "type": "array",
      "minItems": 1,
      "uniqueItems": true,
      "_instruction": "Add all further publications besides the full documentation that provide the original context for the production of this research product version (e.g., an original research article) or receive supplementary material by this research product version.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/core/DOI",        
        "https://openminds.ebrains.eu/core/HANDLE",
        "https://openminds.ebrains.eu/core/ISBN",
        "https://openminds.ebrains.eu/core/ISSN"
      ]
    },
    "releaseDate": {
      "type": "string",
      "_formats": [
        "date"
      ],
      "_instruction": "Enter the date (actual or intended) on which this research product version was first release, formatted as '2023-02-07'."
    },
    "repository": {
      "_instruction": "Add the file repository of this research product version.",
      "_linkedTypes": [
        "https://openminds.ebrains.eu/core/FileRepository"
      ]
    },
    "shortName": {
      "type": "string",
      "_instruction": "Enter a short name (or alias) for this research product version that could be used as a shortened display title (e.g., for web services with too little space to display the full name)."
    },
    "supportChannel": {
      "type": "array",
      "minItems": 1, 
      "uniqueItems": true,
      "_instruction": "Enter all channels through which a user can receive support for handling this research product version.",
      "items": {
        "type": "string",
        "_formats": [
          "email",
          "iri"
        ]
      }
    },
    "versionIdentifier": {
      "type": "string",
      "_instruction": "Enter the version identifier of this research product version."
    },
    "versionInnovation": {
      "type": "string",
      "_instruction": "Enter a short description (or summary) of the novelties/peculiarities of this research product version in comparison to its preceding versions. If this research product version is the first version, you can enter the following disclaimer 'This is the first version of this research product'."
    }
  }
}
